# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10

# num = 20
# my_list = []
# while num > 0:
#     result = num % 2
#     num = num // 2
#     my_list.append(result)
#
# b = ''.join(str(my_list).split(','))
# c = ''.join(str(b).split(' '))
# t = ''.join(str(c).split('['))
# k = c[::-1]
# print(k)